In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))
# Create a list of the CSV files to merge
csv_files = ["Contacts.csv", "Loyalty Customers.csv"]

# Create an empty DataFrame
df = pd.DataFrame()

# Iterate over the list of CSV files
for csv_file in csv_files:

    # Read the CSV file and append it to the DataFrame
    df = df.append(pd.read_csv(csv_file))

# Write the merged DataFrame to a new CSV file
df.to_csv("merged_files.csv")

In [4]:
import pandas as pd

csv_files = ["Contacts.csv", "Loyalty Customers.csv"]

df = pd.DataFrame()

for csv_file in csv_files:
    df_temp = pd.read_csv(csv_file)
    df = df.append(df_temp)

df.to_csv("merged_csv.csv")

In [5]:
data=pd.read_csv("/Users/rohan/Downloads/OneDrive_1_7-4-2023/Loyalty Customers.csv")

In [6]:
data1=pd.read_csv("/Users/rohan/Downloads/OneDrive_1_7-4-2023/Contacts.csv")

In [7]:
data.head()

,LoyaltyId,ContactId,FirstName,LastName,FullName,DateOfBirth,Gender,EMail,Telephone,RewardPoints,CreditCard,CreatedOn
0,LOYID_1000,CNTID_1000,Abbie,Moss,Moss Abbie,08-05-2018,Male,abbie_moss@collinsreedandhoward.com,983.566.0706x9509,293,Yes,19-10-2018
1,LOYID_1001,CNTID_1001,Kenneth,Beraun,Kenneth Beraun,01-08-1974,Male,kenneth_beraun@kimboyle.com,384.995.7852,248,No,23-01-2017
2,LOYID_1002,CNTID_1002,Anthony,Koteles,Anthony Koteles,28-08-1975,Male,anthony_koteles@crawfordsimmonsandgreene.com,-6854,154,No,13-08-2018
3,LOYID_1003,CNTID_1003,Michael,Lauser,Michael Lauser,03-09-2006,Male,michael_lauser@smithinc.com,001-811-506-2553x442,116,No,03-07-2017
4,LOYID_1004,CNTID_1004,Richard,Nakada,Richard Nakada,30-07-1997,Male,richard_nakada@jonesholmesandmooney.com,857-147-6531,249,No,13-10-2017

In [8]:
data1.head()

,ContactId,FirstName,LastName,FullName,DateOfBirth,Gender,EMail,Telephone,PostCode,StreetAddress,City,State,Country,CreatedOn,Headshot,Loyalty Tier,Email Subscriber,Income,Occupation,CustomerSatisfaction
0,CNTID_1000,Abbie,Moss,Abbie Moss,05-08-1986,Female,abbie_moss@collinsreedandhoward.com,983.566.0706x9509,10753,129 Miller Plaza,Fairfield,California,USA,3/14/2017,https://filestransfer.blob.core.windows.net/de...,high,Yes,256414.11270,Software Engineer,high
1,CNTID_1001,Kenneth,Beraun,Beraun Kenneth,08-01-1974,Male,kenneth_beraun@kimboyle.com,384.995.7852,40482,9720 William Prairie,Amarillo,Texas,USA,12/23/2018,https://filestransfer.blob.core.windows.net/de...,medium,Yes,46732.46729,Teacher,high
2,CNTID_1002,Anthony,Koteles,Acthony Koteles,8/28/1975,Male,anthony_koteles@crawfordsimmonsandgreene.com,569-626-5660,28679,3958 Perez Centers Suite 216,Inglewood,California,USA,1/14/2019,https://filestransfer.blob.core.windows.net/de...,medium,Yes,20000.00000,Teacher,high
3,CNTID_1003,Michael,Lauser,Michael Lauser,09-03-2006,Male,michael_lauser@smithinc.com,001-811-506-2553x442,93991,15091 Haynes Neck,Nashville,Tennessee,USA,1/17/2019,https://filestransfer.blob.core.windows.net/de...,medium,No,61917.70614,Teacher,medium
4,CNTID_1004,Richard,Nakada,Nakada Richard,7/30/1997,Male,richard_nakada@jonesholmesandmooney.com,857-147-6531,78389,3501 Thornton Radial,West Covina,California,USA,1/20/2019,https://filestransfer.blob.core.windows.net/de...,medium,No,20000.00000,Teacher,medium

In [9]:
data.describe()

       RewardPoints
count   5002.000000
mean     155.510396
std       82.902366
min       10.000000
25%       84.000000
50%      155.000000
75%      227.000000
max      355.000000

In [10]:
data1.describe()

              Income
count    5002.000000
mean    82758.917928
std     56489.975951
min     20000.000000
25%     38212.874290
50%     74000.290590
75%    111236.581125
max    419076.115900

In [11]:
data.shape

(5002, 12)

In [12]:
data1.shape

(5002, 20)

In [16]:
data1.Income

0       256414.11270
1        46732.46729
2        20000.00000
3        61917.70614
4        20000.00000
            ...
4997     20000.00000
4998     38995.56332
4999     21566.98022
5000     46254.29239
5001     20000.00000
Name: Income, Length: 5002, dtype: float64

In [17]:
sum(data1.Income=='')

0

In [19]:
data1['Occupation'].value_counts()

Teacher               2597
Software Engineer     2192
Student                117
Investment Banking      76
Doctor                  20
Name: Occupation, dtype: int64

In [20]:
data1['Occupation'].fillna('Uknown data')

0       Software Engineer
1                 Teacher
2                 Teacher
3                 Teacher
4                 Teacher
              ...
4997              Teacher
4998              Teacher
4999              Teacher
5000              Teacher
5001              Teacher
Name: Occupation, Length: 5002, dtype: object

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5002 entries, 0 to 5001
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   LoyaltyId     5002 non-null   object
 1   ContactId     5002 non-null   object
 2   FirstName     5002 non-null   object
 3   LastName      5002 non-null   object
 4   FullName      5002 non-null   object
 5   DateOfBirth   5002 non-null   object
 6   Gender        5002 non-null   object
 7   EMail         5002 non-null   object
 8   Telephone     5000 non-null   object
 9   RewardPoints  5002 non-null   int64
 10  CreditCard    5002 non-null   object
 11  CreatedOn     5002 non-null   object
dtypes: int64(1), object(11)
memory usage: 469.1+ KB

In [22]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5002 entries, 0 to 5001
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   ContactId             5002 non-null   object
 1   FirstName             5002 non-null   object
 2   LastName              5002 non-null   object
 3   FullName              5002 non-null   object
 4   DateOfBirth           5001 non-null   object
 5   Gender                5002 non-null   object
 6   EMail                 5002 non-null   object
 7   Telephone             5002 non-null   object
 8   PostCode              5002 non-null   object
 9   StreetAddress         5002 non-null   object
 10  City                  5002 non-null   object
 11  State                 5002 non-null   object
 12  Country               5002 non-null   object
 13  CreatedOn             5002 non-null   object
 14  Headshot              5002 non-null   object
 15  Loyalty Tier          5002 non-null   object
 16  Email Subscriber      5002 non-null   object
 17  Income                5002 non-null   float64
 18  Occupation            5002 non-null   object
 19  CustomerSatisfaction  5002 non-null   object
dtypes: float64(1), object(19)
memory usage: 781.7+ KB